/********************************************************************************************************************
 * 세로 분리 Line 컴포넌트
 * ******************************************************************************************************************/

import { type VerticalDividerProps as Props } from './VerticalDivider.types';

const VerticalDivider = (props: Props) => {
  return <Container {...props} />;
};

export default VerticalDivider;

/********************************************************************************************************************
 * Styled
 * ******************************************************************************************************************/

const Container = styled(Box)`
  display: inline-block;
  &:before {
    content: '|';
    padding: 0 5px;
    color: #cfcfcf;
  }
`;
